SET search_path TO web;

INSERT INTO city(city_name)
VALUES
('Хабаровск'),
('Оренбург'),
('Кишинев'),
('Рязань'),
('Вышний Волочек'),
('Новосибирск'),
('Курск'),
('Санкт-Петербург'),
('Ставрополь'),
('Челябинск'),
('Воронеж'),
('Барнаул'),
('Нижний Новгород'),
('Харьков'),
('Омск'),
('Тверь'),
('Москва');

INSERT INTO applicant(fullname, contact_info, age, city_id, education, work_experience, desired_position, desired_salary)
VALUES
('Ревва Тимур Дмитриевич', '89391689376', 40, 2, '{"МГУ": {"Года учебы": {"Начало": 2000, "Окончание": 2004}, "Факультет": "ВМК", "Достижения": ""}}', NULL, NULL, NULL),
('Варнава Иван Романович', '89058544610', 20, 10, '{"МГУ": {"Года учебы": {"Начало": 2022, "Окончание": 2026}, "Факультет": "ВМК", "Достижения": ""}}', '{"ПАО Сбербанк": {"Дата начала": "17.07.2018", "Дата окончания": "17.07.2020", "Должность": "стажер-аналитик", "Обязанности": ""}}', NULL, NULL),
('Батрудинов Андрей Кириллович', '89600300161', 50, 7, '{"МГУ": {"Года учебы": {"Начало": 1980, "Окончание": 1984}, "Факультет": "ВМК", "Достижения": ""}}', '{"ПАО Сбербанк": {"Дата начала": "01.09.1985", "Дата окончания": "", "Должность": "главный-аналитик", "Обязанности": ""}}', 'руководитель направления аналитики', 2000000),
('Ревва Геннадий Александрович', '89212816293', 20, 9, '{"МГУ": {"Года учебы": {"Начало": 2022, "Окончание": 2026}, "Факультет": "ВМК", "Достижения": ""}}', '{"ПАО Сбербанк": {"Дата начала": "17.07.2018", "Дата окончания": "17.07.2020", "Должность": "стажер-аналитик", "Обязанности": ""}}', NULL, NULL),
('Гудков Владимир Тимурович', '89458106025', 40, 1, '{"МГУ": {"Года учебы": {"Начало": 2000, "Окончание": 0}, "Факультет": "ВМК", "Достижения": ""}}', NULL, NULL, NULL);

INSERT INTO company(company_name, workers_id)
VALUES
('ПАО Сбербанк', array[1, 2, 3]),
('ООО Студенческая столовая', array[4, 3]),
('ПАО Оап', array[1, 3]);

INSERT INTO vacancy(company_id, vacancy_name, salary)
VALUES
(1, 'Директор по развитию', 100000),
(2, 'руководитель отделения аналитики', 500000),
(2, 'руководитель департамента аналитики', 5000000);
